{
    "title": "My Guide To Writing A Killer Cover Letter",
    "id": "tag8l5",
    "create_at": 1646856194.0,
    "score": 1816,
    "comments": [
        {
            "id": "i03go40",
            "parent": "t1_i011fue",
            "ans": "So, why ask for a cover letter?",
            "score": 31,
            "que": "This looks like a great guide but unfortunately as a tech recruiter I can tell you 99% of the time cover letters are not read. \n\nIt is much better to spend time ensuring your CV is clearly laid out, to the point, and visually pleasing. If a reader has to figure out what is going on in your CV it is not a good CV. A person must be able to look at your CV and immediately know what is going on, it should not have to be deciphered.\n\nBigger company recruiters don’t have time to read cover letters. Smaller companies/startups might do, but at that point you’re better off finding the hiring manager and/or recruiter on LinkedIn and dropping them a message to indicate your interest - you’ll stand out more."
        },
        {
            "id": "i03mtm1",
            "parent": "t1_i011fue",
            "ans": "I worked at Uber and one time I had one workshop with a recruiter and she said exactly this, 2 tips she gave that I always carry with me  \n\n\n* Make a resume for each role you apply so you can make it stand out  \n* Try to connect with the manager/recruiter, if is an internal transfer invite them to a coffee",
            "score": 13,
            "que": "This looks like a great guide but unfortunately as a tech recruiter I can tell you 99% of the time cover letters are not read. \n\nIt is much better to spend time ensuring your CV is clearly laid out, to the point, and visually pleasing. If a reader has to figure out what is going on in your CV it is not a good CV. A person must be able to look at your CV and immediately know what is going on, it should not have to be deciphered.\n\nBigger company recruiters don’t have time to read cover letters. Smaller companies/startups might do, but at that point you’re better off finding the hiring manager and/or recruiter on LinkedIn and dropping them a message to indicate your interest - you’ll stand out more."
        },
        {
            "id": "i04g3uw",
            "parent": "t1_i011fue",
            "ans": "So I read OP’s suggestions and I think, “oh this must be why I am not getting recognized”.  Then I read your comment and get discouraged. Now I am conflicted as to whether or not I should out in the time or just keep submitting generic cover letters. This is an exhausting process, albeit one I am continuing to strive for. I wish companies would save the cover letter part for individuals  who are in the latter part of their interview process.",
            "score": 8,
            "que": "This looks like a great guide but unfortunately as a tech recruiter I can tell you 99% of the time cover letters are not read. \n\nIt is much better to spend time ensuring your CV is clearly laid out, to the point, and visually pleasing. If a reader has to figure out what is going on in your CV it is not a good CV. A person must be able to look at your CV and immediately know what is going on, it should not have to be deciphered.\n\nBigger company recruiters don’t have time to read cover letters. Smaller companies/startups might do, but at that point you’re better off finding the hiring manager and/or recruiter on LinkedIn and dropping them a message to indicate your interest - you’ll stand out more."
        },
        {
            "id": "i04gdtf",
            "parent": "t1_i011fue",
            "ans": "> I can tell you 99% of the time cover letters are not read.\n\nHiring manger -- can confirm, never read a single one. In fact, I'm not even sure HR recruiters at my company consistently send them to me. \n\nIt's not a gotcha to see if you're willing to jump through hoops. It's just that whatever HRIS admin that setup our software never bothered to hide the optional cover letter option on the application submission template.",
            "score": 7,
            "que": "This looks like a great guide but unfortunately as a tech recruiter I can tell you 99% of the time cover letters are not read. \n\nIt is much better to spend time ensuring your CV is clearly laid out, to the point, and visually pleasing. If a reader has to figure out what is going on in your CV it is not a good CV. A person must be able to look at your CV and immediately know what is going on, it should not have to be deciphered.\n\nBigger company recruiters don’t have time to read cover letters. Smaller companies/startups might do, but at that point you’re better off finding the hiring manager and/or recruiter on LinkedIn and dropping them a message to indicate your interest - you’ll stand out more."
        },
        {
            "id": "ijus5gj",
            "parent": "t1_i011fue",
            "ans": "So you recommend simply to [buy cover letter](https://coverletterassistant.com/) from service and dont waste time?",
            "score": 1,
            "que": "This looks like a great guide but unfortunately as a tech recruiter I can tell you 99% of the time cover letters are not read. \n\nIt is much better to spend time ensuring your CV is clearly laid out, to the point, and visually pleasing. If a reader has to figure out what is going on in your CV it is not a good CV. A person must be able to look at your CV and immediately know what is going on, it should not have to be deciphered.\n\nBigger company recruiters don’t have time to read cover letters. Smaller companies/startups might do, but at that point you’re better off finding the hiring manager and/or recruiter on LinkedIn and dropping them a message to indicate your interest - you’ll stand out more."
        },
        {
            "id": "j8fqm5l",
            "parent": "t1_i011fue",
            "ans": "I expect recruiters for large companies don't read CLs but if you're applying for a small company, organization or niche job where the applicant pool would be less than maybe a dozen I am sure the hiring manager would read the CL. I say if you are passionate about the job youre applying for then write a good CL.",
            "score": 1,
            "que": "This looks like a great guide but unfortunately as a tech recruiter I can tell you 99% of the time cover letters are not read. \n\nIt is much better to spend time ensuring your CV is clearly laid out, to the point, and visually pleasing. If a reader has to figure out what is going on in your CV it is not a good CV. A person must be able to look at your CV and immediately know what is going on, it should not have to be deciphered.\n\nBigger company recruiters don’t have time to read cover letters. Smaller companies/startups might do, but at that point you’re better off finding the hiring manager and/or recruiter on LinkedIn and dropping them a message to indicate your interest - you’ll stand out more."
        },
        {
            "id": "i02tc0i",
            "parent": "t1_i010b70",
            "ans": "I've hired hundreds of people and I rarely read the cover letter. I usually only read it later on in the process to get additional context but you best believe that if your cover letter has more than a couple of lines/ bullet points it's getting skipped. Sadly, the people that have time to write custom cover letters are usually the weakest candidates that have to resort to that because their resumes/ experience aren't good enough. The badass applicants know they're hot commodities, specially in this industry and more often than not don't include a cover letter. Either way it can't hurt but you definitely shouldn't be spending this much time, it's all a numbers game as so much depends on what the hiring manager is specifically looking for, the biggest issues the company is facing at the time, what mood the interviewers woke up with that day,etc. If you get rejected it's not personal it's just that the company was looking for something specific that you didn't happen to have at the time. As such unless you absolutely only want to work for this company, your time is better spent applying to more or preparing for your interview loops than in a cover letter",
            "score": 10,
            "que": "Good guide but...\n\nHas anybody who actually interviews people read the cover letters or even look at it? I've done interviewing before and I've never even seen the cover letter. If this only gets to HR then it's value is pretty limited. I've additionally only seen one company actually reference my cover letter in an interview.\n\nAdditionally, I strongly disagree with this sentiment: \"It's better to apply for five relevant positions with a complementing cover letter than to apply for fifty positions without any background research.\" Applying to jobs is a numbers game in my and my colleagues experience. Spending an excess amount of time when in all likelihood they toss your application in <2 minutes isn't efficient."
        },
        {
            "id": "i01svqq",
            "parent": "t1_i010b70",
            "ans": "I work in a political, mission driven environment. We read resumes because we want to make sure you know what you're getting into and we need to make sure that you are aligned with our mission. \n\nWe take folks from other industries all the time just fine, even if you don't have domain specific experience, but we want to make sure you know what we do and want to be part of it. Its hard to put you in front of stakeholders if you aren't on board with what we do. I know I came in from a marketing analytics role and no political background and have had a lot of success.\n\nWe explicitly say that the cover letter is factored into our decision in the posting and give instructions for what we're looking for. \n\nWhen you have 20 qualified candidates you want to interview, its easier to toss 5 because they didn't address our questions in their cover letter and interview 15 candidates instead. Reading a cover letter and tossing takes 2-3 minutes... each interview takes a lot of time to execute.",
            "score": 17,
            "que": "Good guide but...\n\nHas anybody who actually interviews people read the cover letters or even look at it? I've done interviewing before and I've never even seen the cover letter. If this only gets to HR then it's value is pretty limited. I've additionally only seen one company actually reference my cover letter in an interview.\n\nAdditionally, I strongly disagree with this sentiment: \"It's better to apply for five relevant positions with a complementing cover letter than to apply for fifty positions without any background research.\" Applying to jobs is a numbers game in my and my colleagues experience. Spending an excess amount of time when in all likelihood they toss your application in <2 minutes isn't efficient."
        },
        {
            "id": "i01850u",
            "parent": "t1_i010b70",
            "ans": "YES. I have. For one, I work at places that are very mission driven and don't want to waste my time on someone who is very misaligned. I've even written job postings explicitly saying \"please include in your cover letter your interest, experience or connection to our work.\" Helpful for screening out applicants who can't follow directions. \n\nSecondly, at least for what I've hired for -- I can screen that you have the technical skills between your resume and a short take home. What I need to know more about is how you think about and approach data problems, how you implement solutions and work with other departments, etc. The cover letter hopefully gives me some of that, and gives me something to ask about. \n\nMy experience is somewhat niche, but in my experience data skills + domain knowledge and/or non-technical experience that's relevant to what I need is way more important than \"has the right keywords on their resume\".\n\nI'm sure \"it's a numbers game\" works for some people, but yes, 100% there are orgs who are looking for something else and spending time on a few applications will be more useful. (Plus work your networks.)\n\nAlso, I thought this approach was interesting -- no resumes, no cover letters, but specific questions to answer for each position. https://brooklyndata.pinpointhq.com/en/jobs/34867",
            "score": 11,
            "que": "Good guide but...\n\nHas anybody who actually interviews people read the cover letters or even look at it? I've done interviewing before and I've never even seen the cover letter. If this only gets to HR then it's value is pretty limited. I've additionally only seen one company actually reference my cover letter in an interview.\n\nAdditionally, I strongly disagree with this sentiment: \"It's better to apply for five relevant positions with a complementing cover letter than to apply for fifty positions without any background research.\" Applying to jobs is a numbers game in my and my colleagues experience. Spending an excess amount of time when in all likelihood they toss your application in <2 minutes isn't efficient."
        },
        {
            "id": "i025cot",
            "parent": "t1_i010b70",
            "ans": "At my last two companies, I never once saw a cover letter in the 300+ interviews I did. When I was doing initial resume reviews, I would look at a resume for <1 minute to decide whether to give them a 20 minute first screen or not. No way would I read a wall of text cover letter.\n\nA long form prose document is sort of unusually in most corporate settings. Almost everything written is meant to be skimmed. It's either short like an email or slack message. Or it's highly formatted with headers, bullet points, graphs, etc. It's going to feel pretty unnatural to read a document full of filler like that cover letter these days.",
            "score": 5,
            "que": "Good guide but...\n\nHas anybody who actually interviews people read the cover letters or even look at it? I've done interviewing before and I've never even seen the cover letter. If this only gets to HR then it's value is pretty limited. I've additionally only seen one company actually reference my cover letter in an interview.\n\nAdditionally, I strongly disagree with this sentiment: \"It's better to apply for five relevant positions with a complementing cover letter than to apply for fifty positions without any background research.\" Applying to jobs is a numbers game in my and my colleagues experience. Spending an excess amount of time when in all likelihood they toss your application in <2 minutes isn't efficient."
        },
        {
            "id": "i02hlrp",
            "parent": "t1_i010b70",
            "ans": ">'ve done interviewing before and I've never even seen the cover letter. If this only gets to HR then it's value is pretty limited. I've additionally only seen one company actually reference my cover letter in an interview.\n\nEvery level 2 interview I've gotten has referenced my cover letter, and our HR definitely reads them and takes them seriously.\n\nI've either skimmed or read them depending on the candidate",
            "score": 1,
            "que": "Good guide but...\n\nHas anybody who actually interviews people read the cover letters or even look at it? I've done interviewing before and I've never even seen the cover letter. If this only gets to HR then it's value is pretty limited. I've additionally only seen one company actually reference my cover letter in an interview.\n\nAdditionally, I strongly disagree with this sentiment: \"It's better to apply for five relevant positions with a complementing cover letter than to apply for fifty positions without any background research.\" Applying to jobs is a numbers game in my and my colleagues experience. Spending an excess amount of time when in all likelihood they toss your application in <2 minutes isn't efficient."
        },
        {
            "id": "i011heo",
            "parent": "t1_i00xghm",
            "ans": "I was about to come in here to make this same comment. As a hiring manager there's very little that you can say in a cover letter that will sway me. Honestly most of the time no one reads them. We're looking at your resume to start off, if there's something good there I'll dig deeper.\n\nThe only time I could see it really having a large impact is if you're transitioning career areas or you're trying to explain something concerning on your resume. In either of those cases keep it short and sweet. I will almost certainly read a paragraph explaining gaps in your resume or irrelevant experience.",
            "score": 40,
            "que": "Guide to writing a cover letter: don't waste your time writing a cover letter"
        },
        {
            "id": "i019kni",
            "parent": "t1_i00xghm",
            "ans": "Also good news from someone who just completed their job search: 9 out of 10 companies don't even expect or accept cover letters anymore. They have a place for you to submit your resume and that's it. I was ecstatic when I realized this and it's made the application process so much easier, at least up front.",
            "score": 5,
            "que": "Guide to writing a cover letter: don't waste your time writing a cover letter"
        },
        {
            "id": "i01l1xi",
            "parent": "t1_i00xghm",
            "ans": "Well, some job postings ask for it. So IMHO, more complete advice would be to write cover letter when you either have to or are pretty sure that it'd help as you know people that'd review it (professors, promotion application, etc.), but do not spend too much time on it, as managers commented here, they are rarely read, as they focus almost 100% on your resume/cv.",
            "score": 3,
            "que": "Guide to writing a cover letter: don't waste your time writing a cover letter"
        },
        {
            "id": "joaieqz",
            "parent": "t1_i00xghm",
            "ans": "With ChatGPT solutions coming out now, you can just use AI to write it. Check out [https://aicoverletter.me](https://aicoverletter.me) for a good one.",
            "score": 1,
            "que": "Guide to writing a cover letter: don't waste your time writing a cover letter"
        },
        {
            "id": "i00wlz1",
            "parent": "t1_i00tzkz",
            "ans": "[deleted]",
            "score": 11,
            "que": "I haven't written a cover letter in years, and I don't plan on doing so any time soon."
        },
        {
            "id": "i02mlv0",
            "parent": "t1_i02kdvq",
            "ans": "LOL",
            "score": 5,
            "que": "My dude wrote a thesis on how to write a useless document."
        },
        {
            "id": "i0ogff0",
            "parent": "t1_i02kdvq",
            "ans": "No, he wrote an advertisement for his useless career website. I'm sure there are some schmucks that will fall for it",
            "score": 2,
            "que": "My dude wrote a thesis on how to write a useless document."
        },
        {
            "id": "i00soeb",
            "parent": "t1_i00o9u8",
            "ans": "> Companies should do away with cover letters. \n\nI literally just asked my coworkers (all DS), it is an automatic pass for them. Same for me, will not bother with a job if it needs one. Not sure if it is widely held opinion, but it seems to be pervasive.",
            "score": 20,
            "que": "Companies should do away with cover letters. The best ones are written by third party professionals. Three things I don’t usually care about when shortlisting resumes:\n1. Cover Letters\n2. Academic degrees\n3. Experience more than 5 years ago"
        },
        {
            "id": "i00rp51",
            "parent": "t1_i00o9u8",
            "ans": "Most don't require them, but it's one more tool to help set yourself apart.",
            "score": 5,
            "que": "Companies should do away with cover letters. The best ones are written by third party professionals. Three things I don’t usually care about when shortlisting resumes:\n1. Cover Letters\n2. Academic degrees\n3. Experience more than 5 years ago"
        },
        {
            "id": "i011k7h",
            "parent": "t1_i00o9u8",
            "ans": "Well to give you the inside scoop: No one actually reads them anyway.",
            "score": 1,
            "que": "Companies should do away with cover letters. The best ones are written by third party professionals. Three things I don’t usually care about when shortlisting resumes:\n1. Cover Letters\n2. Academic degrees\n3. Experience more than 5 years ago"
        },
        {
            "id": "i014cg3",
            "parent": "t1_i00o9u8",
            "ans": "They already have.",
            "score": 1,
            "que": "Companies should do away with cover letters. The best ones are written by third party professionals. Three things I don’t usually care about when shortlisting resumes:\n1. Cover Letters\n2. Academic degrees\n3. Experience more than 5 years ago"
        },
        {
            "id": "i00nztd",
            "parent": "t1_i00nn8c",
            "ans": "Thanks for reading",
            "score": 1,
            "que": "Great guide. Thanks for sharing"
        },
        {
            "id": "i00qt1u",
            "parent": "t1_i00oz6n",
            "ans": "Best way is to already have a DS job and then click \"I'm looking\" on LinkedIn and wait for the recruiter messages to come",
            "score": 24,
            "que": "Great write up, but the best way to secure a data science job is to include a link to your GitHub account so we can see some of your work. That'll get you a lot more calls than a cover letter."
        },
        {
            "id": "i00p5iw",
            "parent": "t1_i00oz6n",
            "ans": "Hey this is a great point! Links to your portfolio are undoubtedly the most important thing. Writing about that next :)",
            "score": 8,
            "que": "Great write up, but the best way to secure a data science job is to include a link to your GitHub account so we can see some of your work. That'll get you a lot more calls than a cover letter."
        },
        {
            "id": "i07ma2e",
            "parent": "t1_i01hfdk",
            "ans": "Love this",
            "score": 1,
            "que": "In a course I had around 10 years ago, an instructor gave us a very simple mnemonic way to write cover letters: the same as a postcard to our grandma.\n\n1- Hello grandma.\n\n2- I hope you're doing well.\n\n3- I'm doing very well over here.\n\n4- I can't wait to see you again and play bridge together.\n\n5- Kisses\n\n\\-------------------\n\n1- Know who you are sending the letter to, good formula to start with.\n\n2- Show that you researched the company and the role and that you are actually interested in it. Identify what they do and why it matters\n\n3- Talk about what's relevant about you with respect to what you identified above. Insist more on personality and traits than skills: they also have your resumee so avoid redundancy.\n\n4- Talk about what you will bring to the company. Show that you understand what they need and that you already constructively project yourself in the role.\n\n5- Politeness formula to end\n\nAnd just like a postcard: keep it short and to the point.\n\n\\-----------------\n\nThis shit is so good, I never had to look again at my notes from this course, never forgot how to make one, and everytime some friends showed me cover letters they wrote they were way worse than mines. It also make it a very simple and efficient process to write one. You know exactly what you need to research, what you need to write and what you're trying to convey when writing it."
        },
        {
            "id": "i01044w",
            "parent": "t1_i00zqiu",
            "ans": "Ha that means a lot. Seriously. Took about 5 weeks to write. Glad you found it helpful",
            "score": 11,
            "que": "Everyone out here whining about how cover letters suck but this one of the best, most impressive guides I have ever seen. Thank you OP"
        },
        {
            "id": "i07mc5m",
            "parent": "t1_i017vso",
            "ans": "Thank you for reading!",
            "score": 1,
            "que": "Amazing job! Thanks for sharing"
        },
        {
            "id": "i00p8dz",
            "parent": "t1_i00nt0q",
            "ans": "Yeah try to make it as readable as possible! Though also mirror the words used in the job description",
            "score": 1,
            "que": "Would you say that following the old rule of thumb of flesche Kincaid 8 or lower is appropriate for cover letters?"
        },
        {
            "id": "i07mfl4",
            "parent": "t1_i00shvv",
            "ans": "Very valid point - the shorter the better",
            "score": 2,
            "que": "Great overall; I would keep an eye on the length though. For a more senior position where there won’t be tons of qualified applicants, longer letters can work, but I don’t have time to read 100 letters this long ;)\n\nIn general, a short letter with relevant content shows great communication skills and capacity to isolate the important.\n\nAnyways, thanks for sharing!"
        },
        {
            "id": "i07m8q1",
            "parent": "t1_i01lci5",
            "ans": "My pleasure",
            "score": 1,
            "que": "This is great! Thanks for sharing!"
        },
        {
            "id": "i07m7y5",
            "parent": "t1_i01o2bk",
            "ans": "You're too kind",
            "score": 1,
            "que": "World needs people like you . Legend forever ♾"
        },
        {
            "id": "i07m8cl",
            "parent": "t1_i01pl4p",
            "ans": "Thank you",
            "score": 1,
            "que": "Gold"
        },
        {
            "id": "jh12p2p",
            "parent": "t1_i01yukw",
            "ans": "Well, looks like you were right long before we knew",
            "score": 2,
            "que": "I've been wondering- is it possible to train a model to write a cover letter for you? I know there's stuff like GPT-3, but I honestly have no idea how it works and what sort of data you'd need or even how it's set up"
        },
        {
            "id": "i0kdy4b",
            "parent": "t1_i03153v",
            "ans": "Thank you for reading :)",
            "score": 2,
            "que": "[deleted]"
        },
        {
            "id": "i0kdzrx",
            "parent": "t1_i03247c",
            "ans": "hell yeah. thank you",
            "score": 1,
            "que": "Well, I didn’t include any cover letter and still got the jobs. However, this guide is a damn good framework for the question “Tell me about yourself” in the interview. Thump ups!"
        },
        {
            "id": "i07m6ph",
            "parent": "t1_i04tcry",
            "ans": "this is a great idea. appreciate you subscribing - big stuff coming soon :)",
            "score": 1,
            "que": "Great guide. In case you were looking for your next idea to research, you could independently research and verify a lot of the claims that others have made in the comments (interactions with recruiters, cv layouts, etc.) I have subscribed to your newsletter and I'm looking forward to more of your work!!"
        },
        {
            "id": "j290int",
            "parent": "t1_j28pw83",
            "ans": "glad to hear it was useful. best of luck :)",
            "score": 1,
            "que": "This is amazing!!! Gold!!! I used your structure- albiet its for a government job so not as selly-- you know. anyways hope I get a positive response from them. Thank you so much for this post!"
        },
        {
            "id": "ji8dt3z",
            "parent": "t1_ji891vr",
            "ans": "BOOM",
            "score": 1,
            "que": "YOU ARE A GENTLEMAN AND A SCHOLAR> THANK YOU FOR THIS SO MUCH YOU ARE MY HERO AND I LOVE YOU FOR THIS"
        },
        {
            "id": "i00nk6t",
            "parent": "t1_i00l63m",
            "ans": "[deleted]",
            "score": 1,
            "que": "[deleted]"
        },
        {
            "id": "i01f8co",
            "parent": "t1_i01a4ng",
            "ans": "Coming soon! Newsletter link in my profile in case you want to get it when it's out :)",
            "score": 2,
            "que": "I need a breakdown like this but for resume!"
        },
        {
            "id": "i07mbm9",
            "parent": "t1_i019tat",
            "ans": "Hmm so I just copy pasted them in!",
            "score": 1,
            "que": "The T-letter (2 column) format definitely works.\n\n\nOFF-TOPIC INFO: How did you embed images in the body of your post as images without markdown links?"
        },
        {
            "id": "i07mafw",
            "parent": "t1_i01dlku",
            "ans": "You're welcome!",
            "score": 1,
            "que": "Thanks!!!"
        },
        {
            "id": "i07m9o4",
            "parent": "t1_i01jhv4",
            "ans": "There's no one way - do what works for you :)",
            "score": 2,
            "que": "There are different approaches to cover letter, but my goal was show what can't be conveyed in the resume - passion for data science. I demonstrate it through a personal narrative approach. Have had multiple hiring managers tell me it's one of the best they've ever read. Do something different to stick out from all the other 1000 boring cover letters."
        },
        {
            "id": "i09i7ks",
            "parent": "t1_i07xvz1",
            "ans": "Thanks for reading",
            "score": 1,
            "que": "This is some great (and thorough) content. Thanks for sharing!"
        },
        {
            "id": "jspzb16",
            "parent": "t1_i08ilay",
            "ans": "Software. People use AI to write cover letters, and companies use AI to read cover letters.\n\nSometimes I wonder what the AI needs us for",
            "score": 1,
            "que": "Who even writes cover letter anymore?"
        },
        {
            "id": "i9e40sz",
            "parent": "t1_i9e2pw3",
            "ans": "exactly. everything is prep for the big show. appreciate it",
            "score": 1,
            "que": "Thanks a lot, unfortunately some places still do require a cover letter and it's better to stand out then not at all even if it's a small chance. Great job!"
        },
        {
            "id": "jutll96",
            "parent": "t1_jur8f8r",
            "ans": "that was the goal. many thanks :)",
            "score": 1,
            "que": "Hey OP, as much as it sucks that this document won't be read. I appreciate the great work you put to make this guide. I have scoured top career resources from the world's top B-Schools and this guide is WAYYYYYYYY better than them. Great job seriously! At the very least, I gained a lot of confidence and unlocked more possibilities on the way I could sell my professional experience to professionals."
        },
        {
            "id": "i03jgdq",
            "parent": "t1_i03go40",
            "ans": "It's just another way to filter the chaff. The people who don't bother to write one are immediately dropped from the applicant pool.",
            "score": 17,
            "que": "So, why ask for a cover letter?"
        },
        {
            "id": "iavv5bl",
            "parent": "t1_i03go40",
            "ans": "Exactly xD",
            "score": 1,
            "que": "So, why ask for a cover letter?"
        },
        {
            "id": "jpvzjjm",
            "parent": "t1_i04gdtf",
            "ans": "This is good to hear.  When I first saw this article I thought, \"what a great way to break the process down.\"  I still believe that.  However, once getting to the final product at the end my first thought was \"no way in hell HR attempts to read something this long.\"",
            "score": 1,
            "que": "> I can tell you 99% of the time cover letters are not read.\n\nHiring manger -- can confirm, never read a single one. In fact, I'm not even sure HR recruiters at my company consistently send them to me. \n\nIt's not a gotcha to see if you're willing to jump through hoops. It's just that whatever HRIS admin that setup our software never bothered to hide the optional cover letter option on the application submission template."
        },
        {
            "id": "ijzrcpz",
            "parent": "t1_ijus5gj",
            "ans": "I don’t have any experience with cover letter services so can not comment on their quality or whether you should use them with 100% certainty.\n\nHaving said that, I would strongly recommend that you write your own cover letter if you do choose to supply one. But again, my advice in my original comment of reaching out to hiring managers and recruiters directly via LinkedIn/email is much more valuable than any cover letter you could possibly write or have written for you. \n\nSometimes in life it’s best not to look for shortcuts and simply put in the work.",
            "score": 2,
            "que": "So you recommend simply to [buy cover letter](https://coverletterassistant.com/) from service and dont waste time?"
        },
        {
            "id": "i03urgc",
            "parent": "t1_i02tc0i",
            "ans": "So fucking true, my sev friend said he doesn't even have CV when applying, he just sends dm on LinkedIn and says he wants to work and adds his personal website, that's it.\n\nNo cvs, no cover letters, nothing\n\nAlso last job he got, he said they called him, talked for 20 mins, gave assignment and next cal was to hire him.\n\nNo screenings, no 40 interviews, nothing.\n\nObviously he is a pro and in demand.",
            "score": 4,
            "que": "I've hired hundreds of people and I rarely read the cover letter. I usually only read it later on in the process to get additional context but you best believe that if your cover letter has more than a couple of lines/ bullet points it's getting skipped. Sadly, the people that have time to write custom cover letters are usually the weakest candidates that have to resort to that because their resumes/ experience aren't good enough. The badass applicants know they're hot commodities, specially in this industry and more often than not don't include a cover letter. Either way it can't hurt but you definitely shouldn't be spending this much time, it's all a numbers game as so much depends on what the hiring manager is specifically looking for, the biggest issues the company is facing at the time, what mood the interviewers woke up with that day,etc. If you get rejected it's not personal it's just that the company was looking for something specific that you didn't happen to have at the time. As such unless you absolutely only want to work for this company, your time is better spent applying to more or preparing for your interview loops than in a cover letter"
        },
        {
            "id": "j71qore",
            "parent": "t1_i02tc0i",
            "ans": "What would you suggest for a graduate with a masters in energy economics with no experience in the field in terms of cover letters?",
            "score": 1,
            "que": "I've hired hundreds of people and I rarely read the cover letter. I usually only read it later on in the process to get additional context but you best believe that if your cover letter has more than a couple of lines/ bullet points it's getting skipped. Sadly, the people that have time to write custom cover letters are usually the weakest candidates that have to resort to that because their resumes/ experience aren't good enough. The badass applicants know they're hot commodities, specially in this industry and more often than not don't include a cover letter. Either way it can't hurt but you definitely shouldn't be spending this much time, it's all a numbers game as so much depends on what the hiring manager is specifically looking for, the biggest issues the company is facing at the time, what mood the interviewers woke up with that day,etc. If you get rejected it's not personal it's just that the company was looking for something specific that you didn't happen to have at the time. As such unless you absolutely only want to work for this company, your time is better spent applying to more or preparing for your interview loops than in a cover letter"
        },
        {
            "id": "i02ukl2",
            "parent": "t1_i01svqq",
            "ans": "The recurring theme seems to be that mission driven environments are where it matters.\n\nThat said, it sounds like asking for short form, one paragraph answers to questions would work better for your interview process. Does the dog and pony show of rewriting your resume, saying why you're such a good fit, and adding the answers to your cover letter really add value over direct questions and direct answers? Is there really a need to consult a ~3,000 word guide to write a cover letter when simple question to answer might be the easier and simpler?",
            "score": 7,
            "que": "I work in a political, mission driven environment. We read resumes because we want to make sure you know what you're getting into and we need to make sure that you are aligned with our mission. \n\nWe take folks from other industries all the time just fine, even if you don't have domain specific experience, but we want to make sure you know what we do and want to be part of it. Its hard to put you in front of stakeholders if you aren't on board with what we do. I know I came in from a marketing analytics role and no political background and have had a lot of success.\n\nWe explicitly say that the cover letter is factored into our decision in the posting and give instructions for what we're looking for. \n\nWhen you have 20 qualified candidates you want to interview, its easier to toss 5 because they didn't address our questions in their cover letter and interview 15 candidates instead. Reading a cover letter and tossing takes 2-3 minutes... each interview takes a lot of time to execute."
        },
        {
            "id": "i02dm8x",
            "parent": "t1_i01850u",
            "ans": "Yup. I interviewed for two very mission driven organizations (their tagline is literally “we want to improve the human condition”) and the cover letters got referenced in my interviews.\n\nThey do get read. Maybe not at FAANG where they probably get like 10k+ apps but definitely at smaller boutique mission driven orgs, they’re getting read.",
            "score": 2,
            "que": "YES. I have. For one, I work at places that are very mission driven and don't want to waste my time on someone who is very misaligned. I've even written job postings explicitly saying \"please include in your cover letter your interest, experience or connection to our work.\" Helpful for screening out applicants who can't follow directions. \n\nSecondly, at least for what I've hired for -- I can screen that you have the technical skills between your resume and a short take home. What I need to know more about is how you think about and approach data problems, how you implement solutions and work with other departments, etc. The cover letter hopefully gives me some of that, and gives me something to ask about. \n\nMy experience is somewhat niche, but in my experience data skills + domain knowledge and/or non-technical experience that's relevant to what I need is way more important than \"has the right keywords on their resume\".\n\nI'm sure \"it's a numbers game\" works for some people, but yes, 100% there are orgs who are looking for something else and spending time on a few applications will be more useful. (Plus work your networks.)\n\nAlso, I thought this approach was interesting -- no resumes, no cover letters, but specific questions to answer for each position. https://brooklyndata.pinpointhq.com/en/jobs/34867"
        },
        {
            "id": "i01fpjy",
            "parent": "t1_i01850u",
            "ans": "I think if they're very mission driven or small that's an argument but anecdotally from my network I haven't heard anybody actually reading a cover letter.\n\nI do agree that data skills and domain knowledge is more important, but I feel like a cover letter isn't the greatest place to get that information. It's highly groomed, just like resumes, and the interviews often show their experience when you ask for caveats or fine details that resumes / cover letters will rarely cover. I've interviewed people whose resumes say they know technical skills and have done data projects, but when interviewed they fumble hard and show that they don't know what they're doing.\n\nAs for it being a numbers game, working your network is definitely the number one strategy. But anecdotally and from peers, cover letters for job postings barely work. Cover letters may give you something like +50% ping backs but I can easily apply to 200-400% more jobs in the time it takes to make a cover letter. Additionally where cover letters are required, I have barely noticed any difference from a mostly canned cover letter with minor adjustments to a completely customized one. That's also if it is even relevant, nothing worse than spending a ton of time to get an instant rejection from a company. If you're getting instantly rejected, much better use of time to apply more.\n\nNow if I KNEW that it was going to be read, i.e. they're a company that says they care, or it was a referral, I would put in the effort, it would be worth it.",
            "score": 1,
            "que": "YES. I have. For one, I work at places that are very mission driven and don't want to waste my time on someone who is very misaligned. I've even written job postings explicitly saying \"please include in your cover letter your interest, experience or connection to our work.\" Helpful for screening out applicants who can't follow directions. \n\nSecondly, at least for what I've hired for -- I can screen that you have the technical skills between your resume and a short take home. What I need to know more about is how you think about and approach data problems, how you implement solutions and work with other departments, etc. The cover letter hopefully gives me some of that, and gives me something to ask about. \n\nMy experience is somewhat niche, but in my experience data skills + domain knowledge and/or non-technical experience that's relevant to what I need is way more important than \"has the right keywords on their resume\".\n\nI'm sure \"it's a numbers game\" works for some people, but yes, 100% there are orgs who are looking for something else and spending time on a few applications will be more useful. (Plus work your networks.)\n\nAlso, I thought this approach was interesting -- no resumes, no cover letters, but specific questions to answer for each position. https://brooklyndata.pinpointhq.com/en/jobs/34867"
        },
        {
            "id": "i03lw3r",
            "parent": "t1_i01850u",
            "ans": "That job i would never apply to. Heavy 6 step process with referrals and stuff... Feels like the company is looking for obediant cattle that can be optimized through excels... Just like adding some questions that needs to be personalized for each company. \n\nIdk if you want the candidates to boost your ego or to present you their skills and knowledge",
            "score": 1,
            "que": "YES. I have. For one, I work at places that are very mission driven and don't want to waste my time on someone who is very misaligned. I've even written job postings explicitly saying \"please include in your cover letter your interest, experience or connection to our work.\" Helpful for screening out applicants who can't follow directions. \n\nSecondly, at least for what I've hired for -- I can screen that you have the technical skills between your resume and a short take home. What I need to know more about is how you think about and approach data problems, how you implement solutions and work with other departments, etc. The cover letter hopefully gives me some of that, and gives me something to ask about. \n\nMy experience is somewhat niche, but in my experience data skills + domain knowledge and/or non-technical experience that's relevant to what I need is way more important than \"has the right keywords on their resume\".\n\nI'm sure \"it's a numbers game\" works for some people, but yes, 100% there are orgs who are looking for something else and spending time on a few applications will be more useful. (Plus work your networks.)\n\nAlso, I thought this approach was interesting -- no resumes, no cover letters, but specific questions to answer for each position. https://brooklyndata.pinpointhq.com/en/jobs/34867"
        },
        {
            "id": "i03gsoz",
            "parent": "t1_i025cot",
            "ans": "So, why ask for cover letter?!",
            "score": 5,
            "que": "At my last two companies, I never once saw a cover letter in the 300+ interviews I did. When I was doing initial resume reviews, I would look at a resume for <1 minute to decide whether to give them a 20 minute first screen or not. No way would I read a wall of text cover letter.\n\nA long form prose document is sort of unusually in most corporate settings. Almost everything written is meant to be skimmed. It's either short like an email or slack message. Or it's highly formatted with headers, bullet points, graphs, etc. It's going to feel pretty unnatural to read a document full of filler like that cover letter these days."
        },
        {
            "id": "jr6xar9",
            "parent": "t1_i02hlrp",
            "ans": "From what I've read so far, it's only u, 1 in a 1000s, the next 999 won't read it.\n\nSo instead ignore that 1 who reads it, and spend time applying to the rest.\n\nImagine writing a cover letter of \"how I fit in ur company, hehe, cute\" as if teens in love, so the boy writes a cringey romantic song to a girl, and she finds a guy who doesn't write any & does the numbers game\\\\/the company rejects u & hires someone with fitting experience without a Cover Letter.\n\n\\--\n\n1. \"our HR definitely reads them and takes them seriously.\" do u do that together, how certain u are he/she is doing it?\n\n&#x200B;\n\n&#x200B;\n\n2. What's the size of ur company & applications per month?",
            "score": 1,
            "que": ">'ve done interviewing before and I've never even seen the cover letter. If this only gets to HR then it's value is pretty limited. I've additionally only seen one company actually reference my cover letter in an interview.\n\nEvery level 2 interview I've gotten has referenced my cover letter, and our HR definitely reads them and takes them seriously.\n\nI've either skimmed or read them depending on the candidate"
        },
        {
            "id": "i013kkb",
            "parent": "t1_i011heo",
            "ans": "As another hiring manager, I've seen thousands and thousands of applications and maybe hundreds of cover letters, and there was exactly one cover letter ever that was useful. We didn't hire him in the end.\n\nDon't write a cover letter. It's useless.",
            "score": 28,
            "que": "I was about to come in here to make this same comment. As a hiring manager there's very little that you can say in a cover letter that will sway me. Honestly most of the time no one reads them. We're looking at your resume to start off, if there's something good there I'll dig deeper.\n\nThe only time I could see it really having a large impact is if you're transitioning career areas or you're trying to explain something concerning on your resume. In either of those cases keep it short and sweet. I will almost certainly read a paragraph explaining gaps in your resume or irrelevant experience."
        },
        {
            "id": "i051165",
            "parent": "t1_i011heo",
            "ans": "This is too reductive. For a certain brand of old school douche bags, it matters. A cover letter won't tip the scale every time, but it will tip the scale some of the time. Ironically, I think it probably tips the scale most in situations for candidates that didn't really need the letter to get a job, but that's not my main point. A cover letter absolutely holds some value in organizations, especially in older companies.\n\nAlso, cover letters are going to raise the likelihood that you end up working with the kind of people who also go the extra mile and write good cover letters. If you have to have coworkers, then you could do a lot worse than kiss-ass go-the-extra-mile cover letter types.\n\nI wouldn't write one because I like working with people as jaded as I am and can't be fucked to spend my time on them, but I think it's a little too reddit hive mind to pretend like they're useless. Besides, it only takes a few minutes and no one ever got rejected from a job worth having because they wrote a good cover letter.",
            "score": 3,
            "que": "I was about to come in here to make this same comment. As a hiring manager there's very little that you can say in a cover letter that will sway me. Honestly most of the time no one reads them. We're looking at your resume to start off, if there's something good there I'll dig deeper.\n\nThe only time I could see it really having a large impact is if you're transitioning career areas or you're trying to explain something concerning on your resume. In either of those cases keep it short and sweet. I will almost certainly read a paragraph explaining gaps in your resume or irrelevant experience."
        },
        {
            "id": "i04fr30",
            "parent": "t1_i01l1xi",
            "ans": "I have one generic cover letter with a brief overview of my interests, skills, and achievements that can apply for almost any job that I would apply to. I am not going to sit and write a personalized cover letter for every single job when I know they aren't gonna read it anyway. It is just a busywork test to pass to get to the real deal. I'm so fucking over the dog and pony show that is the corporate world hiring process.",
            "score": 1,
            "que": "Well, some job postings ask for it. So IMHO, more complete advice would be to write cover letter when you either have to or are pretty sure that it'd help as you know people that'd review it (professors, promotion application, etc.), but do not spend too much time on it, as managers commented here, they are rarely read, as they focus almost 100% on your resume/cv."
        },
        {
            "id": "i03v264",
            "parent": "t1_i00wlz1",
            "ans": "\"Virgin and loving life\" that's the funniest shit I have read 🤣",
            "score": 3,
            "que": "[deleted]"
        },
        {
            "id": "i0118l4",
            "parent": "t1_i00soeb",
            "ans": "Shit, I'm not even deep in my career (~3 years, and as an analyst not a fully fledged DS) and I don't even bother with one. Gotten plenty of interviews for great opportunities without one.",
            "score": 3,
            "que": "> Companies should do away with cover letters. \n\nI literally just asked my coworkers (all DS), it is an automatic pass for them. Same for me, will not bother with a job if it needs one. Not sure if it is widely held opinion, but it seems to be pervasive."
        },
        {
            "id": "i00uzn3",
            "parent": "t1_i00rp51",
            "ans": "It would help me identify the people who are willing to waste their time on nonsense, that is for sure. Way better off linking a video if anything.",
            "score": 0,
            "que": "Most don't require them, but it's one more tool to help set yourself apart."
        },
        {
            "id": "i07mgdh",
            "parent": "t1_i011k7h",
            "ans": "thank you for the inside scoop :)",
            "score": 1,
            "que": "Well to give you the inside scoop: No one actually reads them anyway."
        },
        {
            "id": "i0f8z4m",
            "parent": "t1_i011k7h",
            "ans": "\"Why are you not feeding me right now",
            "score": 1,
            "que": "Well to give you the inside scoop: No one actually reads them anyway."
        },
        {
            "id": "i019p90",
            "parent": "t1_i00p5iw",
            "ans": "I am pushing a few of my projects on github. Would appreciate it if you cover how/what to add and design of github/portfolio",
            "score": 2,
            "que": "Hey this is a great point! Links to your portfolio are undoubtedly the most important thing. Writing about that next :)"
        },
        {
            "id": "i00q1m7",
            "parent": "t1_i00p5iw",
            "ans": "Focus on that. I've hired a lot of data scientists under me and have never read a single cover letter. But, everyone has different things they look for. \n\nI imagine cover letters are good for marketing, design, etc. More creative fields. I'm interested in code and whether or not you can explain it.",
            "score": 1,
            "que": "Hey this is a great point! Links to your portfolio are undoubtedly the most important thing. Writing about that next :)"
        },
        {
            "id": "i010d9d",
            "parent": "t1_i01044w",
            "ans": "This is not an attempt at a humble brag (we’re all anonymous here anyways — I hope), but I attended a top 3 MBA program in the US and this is better than the materials I was given for writing a cover letter.",
            "score": 16,
            "que": "Ha that means a lot. Seriously. Took about 5 weeks to write. Glad you found it helpful"
        },
        {
            "id": "i02xw7e",
            "parent": "t1_i01044w",
            "ans": "This is a very well written guide. I am technically on the side of \"no one will see it\" but I can appreciate that this process will help the candidate structure their thoughts.\n\nI have higher level manger expecting miracle output that I know I can't deliver with my current team. I only have about 30 minutes to decide which one of the 30+ candidate is at the very least not going to slow me down because I have to teach them too much. And if I'm lucky, I get a candidate that can give me a quick run down on who they are personality wise and how their skills can help me,..{cough} I mean, my company.",
            "score": 2,
            "que": "Ha that means a lot. Seriously. Took about 5 weeks to write. Glad you found it helpful"
        },
        {
            "id": "ja3ao1l",
            "parent": "t1_i01044w",
            "ans": "Thank you for writing this out. I think people are too negative around having a cover letter in a submission. When time comes where this document is important, it will be great to at least have a well written one. Your guide is amazing and I learned a lot from it. I think the point is if a cover letter gives you 2% more chance at getting hired, then that's 2% more success rate. Cheers.",
            "score": 1,
            "que": "Ha that means a lot. Seriously. Took about 5 weeks to write. Glad you found it helpful"
        },
        {
            "id": "jez0nnh",
            "parent": "t1_i01044w",
            "ans": "Saving my butt with this, Thank you OP!!",
            "score": 1,
            "que": "Ha that means a lot. Seriously. Took about 5 weeks to write. Glad you found it helpful"
        },
        {
            "id": "jh15rhh",
            "parent": "t1_jh12p2p",
            "ans": "Haha I completely forgot I mentioned that. I never expected that we'd be able to do something like this only a year later",
            "score": 1,
            "que": "Well, looks like you were right long before we knew"
        },
        {
            "id": "i03vxvf",
            "parent": "t1_i03jgdq",
            "ans": "So recruiters don't read it, but drop applicants who don't write it? \n\nThis still does not answer the question on why CLs are needed in the first place.",
            "score": 30,
            "que": "It's just another way to filter the chaff. The people who don't bother to write one are immediately dropped from the applicant pool."
        },
        {
            "id": "i04h296",
            "parent": "t1_i03jgdq",
            "ans": "This simply isn't true. Or, at least, only the shittiest of shitty companies are actually using that kind of filter (in which case, you should be happy to be dropped from consideration).\n\nThe real answer is laziness on both the HR and hiring manager sides. The HRIS admin never disabled the feature to optionally submit a cover letter and the hiring manager doesn't want to review two documents for the >100 applicants they received for a single open position. \n\nI've been on both sides of this -- hiring manager and candidate. And, I've reached the point that I'm so confident in cover letters being pointless that I never submit one. Obviously, I can't ever know if it's eliminated me, but I've always received a good enough callback rate to consider it as something which has never hindered my career prospects.",
            "score": 7,
            "que": "It's just another way to filter the chaff. The people who don't bother to write one are immediately dropped from the applicant pool."
        },
        {
            "id": "j6nu0w9",
            "parent": "t1_ijzrcpz",
            "ans": "> But again, my advice in my original comment of reaching out to hiring managers and recruiters directly via LinkedIn/email is much more valuable than any cover letter you could possibly write or have written for you.\n\nWhen contacting them directly over LinkedIn, what is your usual procedure? Could you please elaborate a little bit on that?",
            "score": 1,
            "que": "I don’t have any experience with cover letter services so can not comment on their quality or whether you should use them with 100% certainty.\n\nHaving said that, I would strongly recommend that you write your own cover letter if you do choose to supply one. But again, my advice in my original comment of reaching out to hiring managers and recruiters directly via LinkedIn/email is much more valuable than any cover letter you could possibly write or have written for you. \n\nSometimes in life it’s best not to look for shortcuts and simply put in the work."
        },
        {
            "id": "j7sakyr",
            "parent": "t1_i03urgc",
            "ans": "You're definitely over glossing some basic logic here. The guy's website is literally his CV, whatever he has on there either proves he can do the work as a web developer, or he has his resume on his website... So, he does send his CV, just in a different format.",
            "score": 7,
            "que": "So fucking true, my sev friend said he doesn't even have CV when applying, he just sends dm on LinkedIn and says he wants to work and adds his personal website, that's it.\n\nNo cvs, no cover letters, nothing\n\nAlso last job he got, he said they called him, talked for 20 mins, gave assignment and next cal was to hire him.\n\nNo screenings, no 40 interviews, nothing.\n\nObviously he is a pro and in demand."
        },
        {
            "id": "idtz2a2",
            "parent": "t1_i03urgc",
            "ans": "Gangster",
            "score": 1,
            "que": "So fucking true, my sev friend said he doesn't even have CV when applying, he just sends dm on LinkedIn and says he wants to work and adds his personal website, that's it.\n\nNo cvs, no cover letters, nothing\n\nAlso last job he got, he said they called him, talked for 20 mins, gave assignment and next cal was to hire him.\n\nNo screenings, no 40 interviews, nothing.\n\nObviously he is a pro and in demand."
        },
        {
            "id": "i04qtme",
            "parent": "t1_i03gsoz",
            "ans": "I haven’t seen places ask for cover letters. Sometimes they have a box you can put stuff in but I always assumed that it was on by default when they’re set up the applicant tracking system. \n\nInstead of a submitting a cover letter, find members of the team and try to find their email or linkedin. Message them directly. Keep the email short, honest and direct. My (wild) guess is that this bumps your odds of getting a first round interview from >5% to ~20%. In other words, it probably won’t work but is still the number one thing to try.",
            "score": 1,
            "que": "So, why ask for cover letter?!"
        },
        {
            "id": "i07opzr",
            "parent": "t1_i051165",
            "ans": "You made a good point, but I also came to the conclusion that I don't want to work for someone who's so dated and stuck in the past. When I first started out, I ALWAYS wrote a cover letter and never got a job from it. \n\nNow, I only fill out the minimum and have not had issues with getting interviews. Of course, this is my personal experience. \n\nI found once I gained some experience (1-2 years), my interview experience completely changed. Recruiters are much friendlier and drastically improve communication. I assume because experienced candidates become much harder to find and they don't want to push you away by being standoffish.",
            "score": 1,
            "que": "This is too reductive. For a certain brand of old school douche bags, it matters. A cover letter won't tip the scale every time, but it will tip the scale some of the time. Ironically, I think it probably tips the scale most in situations for candidates that didn't really need the letter to get a job, but that's not my main point. A cover letter absolutely holds some value in organizations, especially in older companies.\n\nAlso, cover letters are going to raise the likelihood that you end up working with the kind of people who also go the extra mile and write good cover letters. If you have to have coworkers, then you could do a lot worse than kiss-ass go-the-extra-mile cover letter types.\n\nI wouldn't write one because I like working with people as jaded as I am and can't be fucked to spend my time on them, but I think it's a little too reddit hive mind to pretend like they're useless. Besides, it only takes a few minutes and no one ever got rejected from a job worth having because they wrote a good cover letter."
        },
        {
            "id": "i03yf00",
            "parent": "t1_i03v264",
            "ans": "[deleted]",
            "score": 6,
            "que": "\"Virgin and loving life\" that's the funniest shit I have read 🤣"
        },
        {
            "id": "i018rrj",
            "parent": "t1_i0118l4",
            "ans": "Even for junior positions.\n\nWhen I finished my PhD and was looking for postdocs, I hated writing them since a lot of institutions/labs wanted them, and I carried that hate with me when I switched to DS. I never written any letter since then, and got offers just fine. Don't stress over it that much.",
            "score": 3,
            "que": "Shit, I'm not even deep in my career (~3 years, and as an analyst not a fully fledged DS) and I don't even bother with one. Gotten plenty of interviews for great opportunities without one."
        },
        {
            "id": "i019u91",
            "parent": "t1_i019p90",
            "ans": "Sure thing - feel free to DM me. I'll be releasing an article on that next too (newsletter link in my profile)",
            "score": 1,
            "que": "I am pushing a few of my projects on github. Would appreciate it if you cover how/what to add and design of github/portfolio"
        },
        {
            "id": "i010muf",
            "parent": "t1_i010d9d",
            "ans": "So that's what I tried to do - I looked over every single Princeton, Yale, etc guide and tried to make it 10x better.  You made my day :)",
            "score": 11,
            "que": "This is not an attempt at a humble brag (we’re all anonymous here anyways — I hope), but I attended a top 3 MBA program in the US and this is better than the materials I was given for writing a cover letter."
        },
        {
            "id": "i07medd",
            "parent": "t1_i02xw7e",
            "ans": "Appreciate the kind words!",
            "score": 1,
            "que": "This is a very well written guide. I am technically on the side of \"no one will see it\" but I can appreciate that this process will help the candidate structure their thoughts.\n\nI have higher level manger expecting miracle output that I know I can't deliver with my current team. I only have about 30 minutes to decide which one of the 30+ candidate is at the very least not going to slow me down because I have to teach them too much. And if I'm lucky, I get a candidate that can give me a quick run down on who they are personality wise and how their skills can help me,..{cough} I mean, my company."
        },
        {
            "id": "i049fu1",
            "parent": "t1_i03vxvf",
            "ans": "*put tinfoil hat*\n\nThe more time they spend writing a cover letter, the less time they spend applying elsewhere.",
            "score": 21,
            "que": "So recruiters don't read it, but drop applicants who don't write it? \n\nThis still does not answer the question on why CLs are needed in the first place."
        },
        {
            "id": "i2fnyr7",
            "parent": "t1_i03vxvf",
            "ans": "I've very late here. I'd guess to filter out people who are just dropping their CV in every opening with the \"right\" job title. If you write a cover letter it means you've bothered to read the job description in detail, and means you're not just spamming for a bite but more serious about that particular role.",
            "score": 2,
            "que": "So recruiters don't read it, but drop applicants who don't write it? \n\nThis still does not answer the question on why CLs are needed in the first place."
        },
        {
            "id": "jr6n1c1",
            "parent": "t1_i03vxvf",
            "ans": "The same way Data structures & algorithms are asked on programming job where u won't do any of that stuff.\n\nWhen I was young I thought old(er) people are smart, and I and everyone else will be smart, make smart mistakes, learn from it, improve, strive for the best version of thyself, of the company, of relationship, etc.\n\nBut nah, was I WRONG! The human world is made up of 99.999% stupid people, by stupid i mean egoistical, afraid of change, followers of stupid habits just because \"others are doing it that way\".\n\nThere's no chance u try to understand the \"why\" of the things happening in this madness of human of the animal species.\n\nThe \"why\" is answerable about animals of instincts like lions, zebra, monkey, then insects ants, bees, etc. There's no \"why\"-answers to the WORST of the animal species: humans.\n\nU just have to flow with it, there's no stopping trying to understand people, and teach them how to improve.\n\nI've tried it, spend hours explaining, 90% defend themselves, 10% seem to agree with me. Then those 10%'s the next day do the same things, same mistakes, goes into arguments about things they agreed they made mistakes of, when yesterday they seemed like they wanted to stop it & improve.\n\nThey manipulate u and u figure it out later? - Don't go back to explain why they did it, what was better instead.., instead learn from it & do it to others and get rich urself. Don't try to be logical in this illogical world. Don't trust anyone that is \"smart\". Don't trust anyone that is \"nice\". Take everything with a grain of salt and be ALWAYS defensive. Don't open up easily. Instead PRETEND u r opening up, PRETEND u r nice.\n\nGet experience & don't dwell on the \"why\", that'd be always a mystery in this cruel world, just do what works & earn money & do things that makes u happy.\n\n\\---\n\nFinally the cover letter part - #1: do write & send one because it increases ur CHANCES, ignore that \"it is how it is because people are dumb\"-part, #2: do write CL for YOU: so IF they don't act like how they said they will in their \"job description\" call them out! (Because CL is writing how u fit the job description. So, don't write one if u don't fit.)\n\nIn meantime, cheat on them, send other job applications, quit. \n\nOr IF they turned out how they described themselves. Stay there, be happy. Be happy u manipulated them: \"read a Reddit HR's saying how ur chances are increased IF u send CL\" & got hired, otherwise someone else would have stolen ur place.",
            "score": 1,
            "que": "So recruiters don't read it, but drop applicants who don't write it? \n\nThis still does not answer the question on why CLs are needed in the first place."
        },
        {
            "id": "jpvz6ha",
            "parent": "t1_i04h296",
            "ans": "Just curious, what is your call back rate?  I have been submitting CLs for jobs I genuinely would like to have, or are more directly aligned with my experience.  For jobs that just meet my title I opt out of writing a CL.",
            "score": 1,
            "que": "This simply isn't true. Or, at least, only the shittiest of shitty companies are actually using that kind of filter (in which case, you should be happy to be dropped from consideration).\n\nThe real answer is laziness on both the HR and hiring manager sides. The HRIS admin never disabled the feature to optionally submit a cover letter and the hiring manager doesn't want to review two documents for the >100 applicants they received for a single open position. \n\nI've been on both sides of this -- hiring manager and candidate. And, I've reached the point that I'm so confident in cover letters being pointless that I never submit one. Obviously, I can't ever know if it's eliminated me, but I've always received a good enough callback rate to consider it as something which has never hindered my career prospects."
        },
        {
            "id": "jr6umln",
            "parent": "t1_j7sakyr",
            "ans": "I upvoted for ur logic, indeed his website is his showcase of his talents & skills, however it's not really a \"CV\", I mean he doesn't re-create new websites for each new company he applies to.\n\nSo a website is like a Portfolio (\\*web developers build it themselves\\*) rather than a .. what u said \"CV\", but topic was about \"CL\" - Cover Letter I guess u meant, so, his website is not a CL - it's nothing personal in the form of \"how me & the company fit together, hehe.\"\n\nSo yes him sending a website Portfolio is made up of this resume/CV, but the OP's topic - cover letter - is not being sent if it's a static website.\n\n\\-----\n\nOverall, his friend is \"in demand\" but that can only be reached with a lot of experience, his friend perhaps underestimates himself, he's perhaps software engineer with 10+ years of experience and applied for a 100K job who seeks 4-5 years of experience. \n\nHence, he wouldn't get such an easy job offer had he applied for FAANG company.\n\nSo that doesn't apply to us, (rather will ruin our confidence when they reject us and/or push us through \"40 interviews\"), to all of us here looking for \"whether we need to write Cover Letter or not\". We're not \"in demand\".\n\nSo I upvoted u/tiesioginis comment for his first part of the comment, the latter part wasn't necessary, since it's like getting a tip on how to get a girl from Brad Pitt & he'll be like: \"I go to a club, I point to a girl, suggest her to come to me, and she comes\". Yeah but nah. \n\nDo that (\"DM on LinkedIn\"), but be PREPAPRED to go through screenings & \"40 interviews\", otherwise u'll cry about how u r the only person who SUCKS in this world (negative self-talks arises from setting up too high standards, way above our own value & skills).",
            "score": 1,
            "que": "You're definitely over glossing some basic logic here. The guy's website is literally his CV, whatever he has on there either proves he can do the work as a web developer, or he has his resume on his website... So, he does send his CV, just in a different format."
        },
        {
            "id": "i058zo7",
            "parent": "t1_i03yf00",
            "ans": "First they fuck you, later you fuck them",
            "score": 2,
            "que": "[deleted]"
        },
        {
            "id": "ig1rbxo",
            "parent": "t1_i049fu1",
            "ans": "That's why it's so important not to write a cover letter from freakin scratch unless it's a job you are singularly obsessed with. You should certainly tailor your letter for the job, but modifying a robust foundation to fit the need is much more effective than reinventing the wheel every time you want to apply for a job. Folks should focus on working smarter, not harder.",
            "score": 6,
            "que": "*put tinfoil hat*\n\nThe more time they spend writing a cover letter, the less time they spend applying elsewhere."
        },
        {
            "id": "i1hsxfa",
            "parent": "t1_i049fu1",
            "ans": "what if i use a standard cover letter for all my applications, unless you meant the literal time making a single random cover letter lol",
            "score": 1,
            "que": "*put tinfoil hat*\n\nThe more time they spend writing a cover letter, the less time they spend applying elsewhere."
        }
    ]
}